app/controllers/houses_controller.rb

  def create
    @house = House.new(house_params)

    if @house.save
---
INSERT INTO "houses" ("name", "source", "author", "motto", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @house = House.find(params["id"])
    @house.update(house_params)
---
UPDATE "houses" SET "name" = $1, "updated_at" = $2 WHERE "houses"."id" = $3  [["name", "Hufflepuff"], ["updated_at", "2020-01-23 22:12:55.971981"], ["id", 1]]

  def destroy
    @house = House.find(params["id"])
    @house.members.destroy
---
DELETE FROM "houses" WHERE "houses"."id" = $1  [["id", 2]]