app/controllers/members_controller.rb

INSERT INTO "members" ("house_id", "first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["house_id", 1], ["first_name", "Harry"], ["last_name", "Potter"], ["created_at", "2020-01-23 19:37:10.569303"], ["updated_at", "2020-01-23 19:37:10.569303"]]
---
  def create
    @member = Member.new(member_params)
    @house = House.find(params["house_id"])
    @member.house = @house

    if @member.save